/* 
===============================
       MAKE API SECURE
===============================
শুধু যার একসেস আছে ডেটা তার কাছেই শো করবে


Concept
১. প্রত্যেক ভ্যালিড ইউজার এর জন্য ২ টা টোকেন থাকবে (access token, user token)
2. Token এ থাকতে পারে (ইউজার এর ইমেইল/রোল etc)| কিছু সময়ের জন্য ভ্যালিড থাকবে |
৩. রিফ্রেশ টোকেন ব্যাবহার করা হয় একসেস টোকেন ইনভ্যালিড হয়ে গেলে রিক্রিয়েট করারা জন্য
৪. রিফ্রেশ টোকেন ও ইনভ্যালিড হয়ে গেলে লগ আউট করে দিবে 
*/

/* 
===============================
    JWT => Json Web Token
================================
* 1.
* 2.
* 3.
* 4.
* 5.
* 6.
* 7.
* 8.

*/